Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71b/atdf/ATSAMV71J21B.atdf
        <register caption="Interrupt Disable Register Priority Queue (1..5)" name="GMAC_IDRPQ" offset="0x620" rw="W" size="4" count="5" atomic-op="clear:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue (1..5)" name="GMAC_IMRPQ" offset="0x640" rw="RW" size="4" count="5" atomic-op="read:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register" name="GMAC_ST2ER" offset="0x6E0" rw="RW" size="4" count="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register-group caption="Screening Type 2 Compare Word 0 Register" offset="0x700" name="GMAC_ST2CW" size="8" count="24" name-in-module="GMAC_ST2CW"/>
      </register-group>
      <value-group caption="" name="GMAC_NCFGR__CLK">
        <value caption="MCK divided by 8 (MCK up to 20 MHz)" name="MCK_8" value="0x0"/>
        <value caption="MCK divided by 16 (MCK up to 40 MHz)" name="MCK_16" value="0x1"/>
        <value caption="MCK divided by 32 (MCK up to 80 MHz)" name="MCK_32" value="0x2"/>
        <value caption="MCK divided by 48 (MCK up to 120 MHz)" name="MCK_48" value="0x3"/>
        <value caption="MCK divided by 64 (MCK up to 160 MHz)" name="MCK_64" value="0x4"/>
        <value caption="MCK divided by 96 (MCK up to 240 MHz)" name="MCK_96" value="0x5"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__FBLDO">
        <value caption="00001: Always use SINGLE AHB bursts" name="SINGLE" value="0x1"/>
        <value caption="001xx: Attempt to use INCR4 AHB bursts (Default)" name="INCR4" value="0x4"/>
        <value caption="01xxx: Attempt to use INCR8 AHB bursts" name="INCR8" value="0x8"/>
        <value caption="1xxxx: Attempt to use INCR16 AHB bursts" name="INCR16" value="0x10"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__RXBMS">
        <value caption="4/8 Kbyte Memory Size" name="EIGHTH" value="0x0"/>
        <value caption="4/4 Kbytes Memory Size" name="QUARTER" value="0x1"/>
        <value caption="4/2 Kbytes Memory Size" name="HALF" value="0x2"/>
        <value caption="4 Kbytes Memory Size" name="FULL" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW1__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="J">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR" offset="0x0" rw="RW" size="4" count="8">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module name="ICM" caption="Integrity Check Monitor" id="11105" version="H">
      <register-group name="ICM">
        <register caption="Configuration Register" name="ICM_CFG" offset="0x00" rw="RW" size="4">
          <bitfield caption="Write Back Disable" mask="0x00000001" name="WBDIS"/>
          <bitfield caption="End of Monitoring Disable" mask="0x00000002" name="EOMDIS"/>
          <bitfield caption="Secondary List Branching Disable" mask="0x00000004" name="SLBDIS"/>
          <bitfield caption="Bus Burden Control" mask="0x000000F0" name="BBC"/>
          <bitfield caption="Automatic Switch To Compare Digest" mask="0x00000100" name="ASCD"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000200" name="DUALBUFF"/>
          <bitfield caption="User Initial Hash Value" mask="0x00001000" name="UIHASH"/>
          <bitfield caption="User SHA Algorithm" mask="0x0000E000" name="UALGO" values="ICM_CFG__UALGO"/>
        </register>
        <register caption="Control Register" name="ICM_CTRL" offset="0x04" rw="W" size="4">
          <bitfield caption="ICM Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="ICM Disable Register" mask="0x00000002" name="DISABLE"/>
          <bitfield caption="Software Reset" mask="0x00000004" name="SWRST"/>
          <bitfield caption="Recompute Internal Hash" mask="0x000000F0" name="REHASH"/>
          <bitfield caption="Region Monitoring Disable" mask="0x00000F00" name="RMDIS"/>
          <bitfield caption="Region Monitoring Enable" mask="0x0000F000" name="RMEN"/>
        </register>
        <register caption="Status Register" name="ICM_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="ICM Controller Enable Register" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Region Monitoring Disabled Raw Status" mask="0x00000F00" name="RAWRMDIS"/>
          <bitfield caption="Region Monitoring Disabled Status" mask="0x0000F000" name="RMDIS"/>
        </register>
        <register caption="Interrupt Enable Register" name="ICM_IER" offset="0x10" rw="W" size="4" atomic-op="set:ICM_IMR">
          <bitfield caption="Region Hash Completed Interrupt Enable" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Enable" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Enable" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition detected Interrupt Enable" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected Interrupt Enable" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Disable" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Enable" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Disable Register" name="ICM_IDR" offset="0x14" rw="W" size="4" atomic-op="clear:ICM_IMR">
          <bitfield caption="Region Hash Completed Interrupt Disable" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Disable" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Disable" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected Interrupt Disable" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition detected Interrupt Disable" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Disable" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Disable" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Mask Register" name="ICM_IMR" offset="0x18" rw="R" size="4" atomic-op="read:ICM_IMR">
          <bitfield caption="Region Hash Completed Interrupt Mask" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Mask" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Mask" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected Interrupt Mask" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected Interrupt Mask" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Mask" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Mask" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Status Register" name="ICM_ISR" offset="0x1C" rw="R" size="4" atomic-op="clear:ICM_ISR">
          <bitfield caption="Region Hash Completed" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Detected" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Status" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Undefined Access Status Register" name="ICM_UASR" offset="0x20" rw="R" size="4">
          <bitfield caption="Undefined Register Access Trace" mask="0x00000007" name="URAT" values="ICM_UASR__URAT"/>
        </register>
        <register caption="Region Descriptor Area Start Address Register" name="ICM_DSCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Descriptor Area Start Address" mask="0xFFFFFFC0" name="DASA"/>
        </register>
